//МЕТОД МАСИВУ splice (мутуючий)
//array.splice - використовується для зміни вмісту масиву шляхом видалення, заміни або додавання нових елементів
//array.splice(start,deliteCount,.....items)  - start - початковий індекс, з якого починається змінюватись масив
//                                 - deliteCount - вказує кількість елеменів, які потрібно видалити з масиву
//                                   якщо не вкажемо deliteCount, то всі елементи в масиві будуть видалені
//                                 - items, починаючи з третього елементу - можна додавати нові елементи, які будуть вставлені на місце видалених елементів
//За дпомогою splice ви може:
//  - видаляти потрібну кільеість елементів deliteCount, починаючи з певного індексу масива (start)
//  - вставити потрібну кількість елементів у масив (....items) у потрібну позицію масиву (start), при цьому видалення елементів може і не відбуватись коли (deliteCount = 0)
//  - вставити (....items) і видаляти (deliteCount) елементи одночасно, починаючи з певної позиції масиву(start)
const array = [1,2,3,4,5]

//Задача. Починаючи з другого індексу, видалити один елемент
console.log(array.splice(2, 2));

//Задача. Після двійки додати рядок 'Hello', 'Nataliia', 'Yakovenko', прицьому нічого не видаляючи
const array1 = [1,2,5]
console.log(array1.splice(2,0,'Hello','Nataliia', 'Yakovenko'))

//Задача. Починаючи з 2 індесу видалити 3 елементи і вставити числа 3,4
const array2 = [1,2,'Hello','Nataliia', 'Yakovenko']
array2.splice(2,3,3,4);
console.log(array2);

//Задача. Починаючи з 2 індесу додати масив
const array3 = [1,2]
array3.splice(2,0,['Nataliia', 'Yakovenko'])
console.log(array3)