//array.sort - використовується для сортування елементів в масиві (мутуючий)
//array.sort - переставляє елементи масиву на місцях. Можна задавати власний поряжок
//array.sort([compareFunction]) - синтакси array.sort

const array = [2,5,8,9,88,43,5,3]
//Відсортувати масив за зростанням
array.sort() //-сортування за зростанням (unicode)
console.log(array);

//як буде сортувати масив з літерами за зростанням
const array1 =['bbb','aaa','aba','acb']
array1.sort()       //сортування за зростанням (unicode)
console.log(array1);

//сортувати за власним порядком
function compareFunction(a,b,){ // функція компоратор
                   // a - поточне переглядаєме число
                   // b - наступне число, яке слідує за поточним
}
//Функція компоратор повинна повернути (return) одне з трьох можливих значень:
/*
-1    - якщо потрібно щоб спочатку було значеня а потім b
 0    - елементи залишаються на місці
 1    - якщо потрібно щоб спочатку було значеня b потім a
*/

//відсортувати за зростанням
//варіант1
const array2 = [2,5,8,9,88,43,5,3]
function compareFunction(a,b,){
   if(b>a){
    return -1
   } else {
    return 1
   }
}
array2.sort(compareFunction);
console.log(array2);

 //варіант2 - працює тільки з цифрами
 const array3 = [2,5,8,9,88,43,5,3]
 function compareNumbers(a,b){
    return a-b // зростання від меньшого до більшого
    // або  b-a - зростання від більшого до меньшого
 }
 array3.sort(compareNumbers);
console.log(array3);