// МЕТОДИ МАСИВІВ

//array.shift - використовується для видалення першого елементу з початку масиву

const array1 = [33,44,55,66,77]
console.log(array1.shift());
//-------------------------------------------------------------------------------
//array.unshift - використовується для додавання одного або декілька елементів на початок масиву
//array.unshift(element1, element2,.........)

const array2 = [33,44,55,66,77]
console.log(array2.unshift(-1,0))
//-------------------------------------------------------------------------------
//array.reversу - використовується для зміни порядку елементів у масиві на протилежний

const array3 = [33,44,55,66,77]
console.log(array3.reverse());
//-------------------------------------------------------------------------------

//Методи, які змінюють вихідний масив, називають МУТУЮЧІ методи
//Методи, які НЕ змінюють вихідний масив, називають НЕМУТУЮЧІ методи (більшість методів масиву)

//МУТУЮЧІ методи
// - array.fill
// - array.push
// - array.push
// - array.shift
// - array.unshift
// - array.reverse

//НЕМУТУЮЧІ методи
// - array.concat
// - array.includes
// - array.indexOf
// - array.join
//----------------------------------------------------------------------------

//Приклад масиву concat
const nataliia = ['I','will','be','rich'] // first array
const money = [100000000,20000000,30000000]// second array
//створюємо новий масив, в якій з'єднуємо first array і second array
const monaco = nataliia.concat(money);
console.log(monaco)