//Вкладені цикли
/*
Задача, вивести на консоль таблицю множення від 1 до 5
 */
for (let i = 1; i <= 5; i++) {// число для якого ми виводимо таблицю множення
  for (let j = 1; j <= 5; j++) {// 1*1,1*2,1*3,1*4,1*5 - числа, на які ми множимо число з зовнішнього циклу
    console.log(`${i}x${j} = ${i * j}`);
  }
}
//------------------------------------------------------------------------------------------
//Потрібно знайти суму елементів масиву numbers

const numbers = [[1,2,3],[4,5,6],[7,8,9]]
let sum = 0;
for (let i = 0;i < numbers.length;i++){// зовнішній цикл контролює масив, який ми переглядаємо
  for(let j = 0; j < numbers[i].length;j++){ // внутрішній цикл сумує всі елементи поточного переглядаємого масиву
    sum += numbers[i][j] // отримуємо доступ до поточного елемнту переглядаємого  вкладеного масиву
  }
}
console.log(sum);