// МЕТОДИ МАСИВІВ

// Concat - з'єднує один метод з іншим
//використовується для об'єднання декількох масивів в один масив
//array.concat(array1, array2,......)

const array1 = [1,2,3,4]
const array2 = array1.concat([11,22,33,44]) //до поточного метода додаємо елементи іншого метода
console.log(array2);
//------------------------------------------------------------------------------
//array.fill() - використовується для заповнення всіх елементів масиву якимсь одним значенням
//array.fill(value, [start,end]) - приймає три аргументи// start, end - необов'язкові
//array.fill() - повертає змінений початковий масив

const array3 = new Array(5);//створили конструктор масив на 5 елементів
array3.fill(1);
//------------------------------------------------------------------------------
//array.includes - використовується для перевріки наявності певного значення у масиві
//array.includes(searchValue, [fromIndex]) - приймає два елементи,fromIndex - необов'язковий аргумент
//array.includes -повертає або true або false 

const array4 =[2,4,6,8,4,12,33,41]
console.log(array4.includes(33))
//------------------------------------------------------------------------------
//array.indexOf - використовується для отримання першого входження певного значення у масиві
//array.indexOf(searchElement, [fromIndex]) - повертає індекс першого входження пошукового елемента в масиві
//уразі, якощо пошуковий елемент не знайден то нам повертається значення -1

const array5 =[2,4,6,8,7,12,33,41]
console.log(array5.indexOf(33));
//------------------------------------------------------------------------------
//array.join - використовується для створення рядка об'єднуїчі всі елеенти масиву
//array.join([separator]) - це наш розділитель - це , кома
//array.join - повертає новий рядок утворений шляхом об'єднання всіх елемнтів масиву за даопомогою separator

const array6 = ['Hello', 'world', 4, 2, 'hi' ];
console.log(array6.join(' ')); 
//-------------------------------------------------------------------------------
//array.push - додавання одного або декілька елементів в кінець масиву
//array.push(element1, element2...........)

const array7 = [2,3,4,5]
console.log(array7.push(6,7,8,9,10));
//-------------------------------------------------------------------------------
//array.pop - викликається для видалення ОСТАНЬОГО елементу

const array8 =[2,4,6,8,7,12,33,41]
console.log(array8.pop())
console.log(array8.pop())
console.log(array8.pop())
//--------------------------------------------------------------------------------
