// && - логічний оператор і, коли обдва операнди є істиною, в якості операндів будуть умови
//Задача: перевірити вік людини і наявність права на керування авто
//На підставі цього зробити висновок, чи може людина сісти за кермо чи ні
//Базові правила:
//Керувння авто  з 18 років + для цього потрібні права

const age = 23;
const hasLicense = true;

if (age >=18 && hasLicense === true ) {
   console.log('Ви можете сісти за кермо');
} else if (age <=18 ) {
   console.log('Ви не можете сісти за кермо');
} else if (hasLicense === false){
   console.log('У вас не має прав на керування');
} else {
   console.log('Виникла помилка');
}
