//Функції - (Functions)
// Функція (підпрограма) - блок коду, який виконує певні дії при виклику
// Функція може примати аргументи - значення, які передаються у функцію. Функція може викорстовувати аргументи у своїй роботі
// Функція може повертати значення, а може і не повертати
// Функція - це фрагмент програмного коду, до якого можна звернутись з іншого місця програми

/* Синтаксис функції
Як оголосити функцію?
  function ім'я функції(аргумент1, аргумент2) {
        тіло функції
} 
 */

//Задача
// Написати функцію, яка буде приймати ім'я користувача: і буде вітатись з цим користувачем

function greeting(userName){
   //userName - абстракція на якій ми зав'язуємо логіку роботи функції
   //userName - формальний параметр
   console.log('Привіт, '+ userName);
}
//Використання функції
//Параметри, які ви передаєте при виклику функції - це формальні параметри
greeting('Alex') //Аlex - це аргумент функції - фактичний параметр
greeting('Jon'); // Jon - фактичний параметр
greeting('Sem'); // Sem - фактичний параметр
greeting('Salam'); //Salar - фактичний параметр
