//ШАБЛОННІ РЯДКИ
//Рядки, які знаходяться у зворотніх лапках називаються Шаблонні рядки
//Задача
//В середині альорту вивести розрахунок 2+2 =
//alert('2+2=' + (2+2))


//Вирази укладаються `${.....}`
const nickname = 'Вася'

//Створити альорт і привітатися з Васею
//alert('Привіт,' + nicknamename + '!')

//alert(`Привіт, ${nickname}!`)
//alert(`результат: ${1+2}`)

//Задача. Запитати у користувача 2 числа і вивести альортом
const num1 = Number(prompt('Enter first number'))
const num2 = Number(prompt('Enter second number'))
alert(`${num1} + ${num2} = ${num1+num2}`)