// МЕТОДИ ОБХЛДУ МАСИВА 
// forEach

//array.forEach - використовується для перебору (ітерації) кожного елемента масиву і виконання певної дії для виконання кожного елемента
//array.forEach(callback) - викликає функцію зворотнього виклику

//Задача. У нас є масив чисел
//Кожне значення масиву піднести у квадрат
//Варіант1
const array = [1,2,3,4,5]
function square(a){  //функція, яка буде приймати число
 console.log(a*a);   //виводить квадрат цього числа
}
array.forEach(square)  //нашу функцію передаємо forEach


//Варіант2
const array1 = [11,22,33,44,55]
//можна використати стрілкову функцію ()=>{}
array1.forEach((item,index, array1)=>{
    console.log(item*item);
})
                      //item - поточний переглядаємий елемент в масиві
                      //index - індекс поточного переглядаємого елемента в масиві
                      //array - посилання на вихідний масив, масив , який ми створили
//------------------------------------------------------------------------------------

//Приклад стрілкової функції
const square1 = (number) => {
    return number * number};
console.log(square1(6))